src/cf/Catalogs/fmInfoStructures.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmInfoStructures</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>StructureType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmInfoStructureTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ViewFormat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmRoundMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EditFormat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmRoundMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DontOutputRowsOutOfStructure</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BudgetTotalType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetTotalType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/fmBindingInfoStructuresToDepartments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmBindingInfoStructuresToDepartments</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ApplyByDefault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>InfoStructure</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmInfoStructures</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/fmInfoStructures/Forms/ChoiceFormBinding/Ext/Form/Module.bsl
#Region ProceduresAndFunctionsOfCommonUse

&AtClient
Procedure ChooseValue()
	CurValue = Items.InfoStructuresList.CurrentData;
	If NOT CurValue = Undefined Then
		Close(CurValue.InfoStructure);
	EndIf;
EndProcedure //ВыбратьЗначение()

#EndRegion

#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// Получим значения структур сведений.
	Query = New Query();
	Query.Text = "SELECT
	|	fmBindingInfoStructuresToDepartments.InfoStructure,
	|	fmBindingInfoStructuresToDepartments.ApplyByDefault AS ApplyByDefault
	|FROM
	|	InformationRegister.fmBindingInfoStructuresToDepartments AS fmBindingInfoStructuresToDepartments
	|WHERE
	|	fmBindingInfoStructuresToDepartments.Department = &Department
	|	AND fmBindingInfoStructuresToDepartments.InfoStructure.StructureType = &StructureType
	|
	|ORDER BY
	|	ApplyByDefault DESC";
	Query.SetParameter("Department", Parameters.Department);
	Query.SetParameter("StructureType", Parameters.StructureType);
	InfoStructuresList.Load(Query.Execute().Unload());
	
	// Установим текстроку при возможности.
	If Parameters.Property("Key") AND ValueIsFilled(Parameters.Key) Then
		For Each CurRow In InfoStructuresList Do
			If CurRow.InfoStructure=Parameters.Key Then
				Items.InfoStructuresList.CurrentRow = CurRow.GetID();
				Break;
			EndIf;
		EndDo;
	EndIf;
	
EndProcedure

#EndRegion

#Region FormItemsEventsHandlers

&AtClient
Procedure SELECT(Command)
	ChooseValue();
EndProcedure //Выбрать()

&AtClient
Procedure WithoutStructure(Command)
	Close(PredefinedValue("Catalog.fmInfoStructures.EmptyRef"));
EndProcedure //БезСтруктуры()

&AtClient
Procedure InfoStructureListChoice(Item, SelectedRow, Field, StandardProcessing)
	ChooseValue();
EndProcedure //СписокСтруктурСведенийВыбор()

&AtClient
Procedure OpenStructure(Command)
	CurValue = Items.InfoStructuresList.CurrentData;
	If NOT CurValue = Undefined Then
		ShowValue(,CurValue.InfoStructure);
	Else
		CommonClientServer.MessageToUser(NStr("en='You should select a structure.';ru='Необходимо выбрать структуру'"));
	EndIf;
EndProcedure

#EndRegion
